-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 04, 2026 at 06:05 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `edvtstc`
--

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `student_id` varchar(15) NOT NULL,
  `fullname` varchar(100) NOT NULL,
  `birth_date` varchar(20) NOT NULL,
  `group_code` varchar(10) DEFAULT NULL,
  `group_name` varchar(100) DEFAULT NULL,
  `advisor_name` varchar(100) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `is_first_login` tinyint(1) DEFAULT 1,
  `place_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`student_id`, `fullname`, `birth_date`, `group_code`, `group_name`, `advisor_name`, `password`, `is_first_login`, `place_id`) VALUES
('67201010043', 'นายจิรวัฒน์ ใจเพ็ชร', '28/06/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010043', 1, NULL),
('67201010044', 'นายกันตินันท์ กล่ำเดช', '15/03/2552', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010044', 1, NULL),
('67201010045', 'นายสืบสกุล มีแก้วน้อย', '14/07/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010045', 1, NULL),
('67201010046', 'นายกฤษฎา กันสำอาง', '8/01/2552', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010046', 1, NULL),
('67201010047', 'นายธนาคม โถแพ', '27/01/2552', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010047', 1, NULL),
('67201010048', 'นายรัฐภูมิ สุวรรณนุรักษ์', '20/04/2552', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010048', 1, NULL),
('67201010049', 'นายสถาพร สุขเกษมฤทัย', '25/10/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010049', 1, NULL),
('67201010050', 'นายวัชรพล วรเลิศ', '15/07/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010050', 1, NULL),
('67201010051', 'นายอมรเทพ นาคเวช', '28/09/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010051', 1, NULL),
('67201010052', 'นายเฉลิมพงศ์ บุญเหลือ', '08/07/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010052', 1, NULL),
('67201010053', 'นายธนายุ ลาภโสภา', '22/09/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010053', 1, NULL),
('67201010054', 'นายนภัสกร เขียวมณี', '28/02/2552', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010054', 1, NULL),
('67201010055', 'นายกิตติศักดิ์ แจ้งประจักษ์', '26/02/2552', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010055', 1, NULL),
('67201010056', 'นายณัฐภัทร พวงเกษม', '18/05/2552', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010056', 1, NULL),
('67201010057', 'นายภควัต ชาวคูเวียง', '26/11/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010057', 1, NULL),
('67201010058', 'นายสิทธิชัย ฉิมพลี', '09/04/2552', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010058', 1, NULL),
('67201010059', 'นายธนวัฒน์ มีแก้ว', '17/11/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010059', 1, NULL),
('67201010060', 'นายธนภูมิ พุทธรักษา', '01/05/2552', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010060', 1, NULL),
('67201010061', 'นายรัชพล กิจเจริญ', '06/04/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010061', 1, NULL),
('67201010062', 'นายสมรัตน์ กล้าหาญ', '15/02/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010062', 1, NULL),
('67201010063', 'นายธนณัฏฐ์ หมอยา', '17/11/2551', '672010103', 'ช่างยนต์ ช่างยนต์/3 | ปวช.3 (ชย. 3/3 )', 'นายสุรเชษฐ์ ขาวโต', '67201010063', 1, NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`student_id`),
  ADD KEY `fk_student_place` (`place_id`);

--
-- Constraints for dumped tables
--

--
-- Constraints for table `students`
--
ALTER TABLE `students`
  ADD CONSTRAINT `fk_student_place` FOREIGN KEY (`place_id`) REFERENCES `internship_places` (`place_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
